{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_4", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 19, 19], "dtype": "float32", "sparse": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "init_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "init_conv_block", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "init_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "init_batch_norm", "inbound_nodes": [[["init_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "init_relu"}, "name": "init_relu", "inbound_nodes": [[["init_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "0_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "0_conv_block", "inbound_nodes": [[["init_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "0_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "0_batch_norm", "inbound_nodes": [[["0_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "0_relu"}, "name": "0_relu", "inbound_nodes": [[["0_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "1_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "1_conv_block", "inbound_nodes": [[["0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "1_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "1_batch_norm", "inbound_nodes": [[["1_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "1_relu"}, "name": "1_relu", "inbound_nodes": [[["1_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "2_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "2_conv_block", "inbound_nodes": [[["1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "2_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "2_batch_norm", "inbound_nodes": [[["2_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "2_relu"}, "name": "2_relu", "inbound_nodes": [[["2_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "3_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "3_conv_block", "inbound_nodes": [[["2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "3_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "3_batch_norm", "inbound_nodes": [[["3_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "3_relu"}, "name": "3_relu", "inbound_nodes": [[["3_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "4_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "4_conv_block", "inbound_nodes": [[["3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "4_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "4_batch_norm", "inbound_nodes": [[["4_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "4_relu"}, "name": "4_relu", "inbound_nodes": [[["4_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "5_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "5_conv_block", "inbound_nodes": [[["4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "5_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "5_batch_norm", "inbound_nodes": [[["5_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "5_relu"}, "name": "5_relu", "inbound_nodes": [[["5_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "6_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "6_conv_block", "inbound_nodes": [[["5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "6_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "6_batch_norm", "inbound_nodes": [[["6_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "6_relu"}, "name": "6_relu", "inbound_nodes": [[["6_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "7_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "7_conv_block", "inbound_nodes": [[["6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "7_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "7_batch_norm", "inbound_nodes": [[["7_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "7_relu"}, "name": "7_relu", "inbound_nodes": [[["7_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "8_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "8_conv_block", "inbound_nodes": [[["7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "8_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "8_batch_norm", "inbound_nodes": [[["8_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "8_relu"}, "name": "8_relu", "inbound_nodes": [[["8_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "9_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "9_conv_block", "inbound_nodes": [[["8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "9_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "9_batch_norm", "inbound_nodes": [[["9_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "9_relu"}, "name": "9_relu", "inbound_nodes": [[["9_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "10_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "10_conv_block", "inbound_nodes": [[["9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "10_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "10_batch_norm", "inbound_nodes": [[["10_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "10_relu"}, "name": "10_relu", "inbound_nodes": [[["10_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "11_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "11_conv_block", "inbound_nodes": [[["10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "11_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "11_batch_norm", "inbound_nodes": [[["11_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "11_relu"}, "name": "11_relu", "inbound_nodes": [[["11_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "value_head_conv_block", "filters": 1, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "value_head_conv_block", "inbound_nodes": [[["11_relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "policy_head_conv_block", "filters": 2, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "policy_head_conv_block", "inbound_nodes": [[["11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "value_head_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "value_head_batch_norm", "inbound_nodes": [[["value_head_conv_block", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "policy_head_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "policy_head_batch_norm", "inbound_nodes": [[["policy_head_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "value_head_relu"}, "name": "value_head_relu", "inbound_nodes": [[["value_head_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "policy_head_relu"}, "name": "policy_head_relu", "inbound_nodes": [[["policy_head_batch_norm", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 256, "activation": "relu", "name": "value_head_dense", "bias_constraint": null, "bias_regularizer": null, "trainable": true}, "name": "value_head_dense", "inbound_nodes": [[["value_head_relu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 362, "activation": "linear", "name": "policy_head_dense", "bias_constraint": null, "bias_regularizer": null, "trainable": true}, "name": "policy_head_dense", "inbound_nodes": [[["policy_head_relu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 1, "activation": "tanh", "name": "value_head_output", "bias_constraint": null, "bias_regularizer": null, "trainable": true}, "name": "value_head_output", "inbound_nodes": [[["value_head_dense", 0, 0, {}]]]}], "name": "model_4", "output_layers": [["policy_head_dense", 0, 0], ["value_head_output", 0, 0]]}, "keras_version": "2.2.0"}