{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 19, 19], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "init_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "init_conv_block", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "init_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "init_batch_norm", "inbound_nodes": [[["init_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "init_relu"}, "name": "init_relu", "inbound_nodes": [[["init_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_0_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_0_conv_block", "inbound_nodes": [[["init_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_0_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_0_batch_norm", "inbound_nodes": [[["residual_1_0_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_0_relu"}, "name": "residual_1_0_relu", "inbound_nodes": [[["residual_1_0_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_0_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_0_conv_block", "inbound_nodes": [[["residual_1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_0_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_0_batch_norm", "inbound_nodes": [[["residual_2_0_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_0", "trainable": true}, "name": "add_0", "inbound_nodes": [[["init_relu", 0, 0, {}], ["residual_2_0_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "0_relu"}, "name": "0_relu", "inbound_nodes": [[["add_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_1_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_1_conv_block", "inbound_nodes": [[["0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_1_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_1_batch_norm", "inbound_nodes": [[["residual_1_1_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_1_relu"}, "name": "residual_1_1_relu", "inbound_nodes": [[["residual_1_1_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_1_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_1_conv_block", "inbound_nodes": [[["residual_1_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_1_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_1_batch_norm", "inbound_nodes": [[["residual_2_1_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["0_relu", 0, 0, {}], ["residual_2_1_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "1_relu"}, "name": "1_relu", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_2_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_2_conv_block", "inbound_nodes": [[["1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_2_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_2_batch_norm", "inbound_nodes": [[["residual_1_2_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_2_relu"}, "name": "residual_1_2_relu", "inbound_nodes": [[["residual_1_2_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_2_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_2_conv_block", "inbound_nodes": [[["residual_1_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_2_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_2_batch_norm", "inbound_nodes": [[["residual_2_2_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true}, "name": "add_2", "inbound_nodes": [[["1_relu", 0, 0, {}], ["residual_2_2_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "2_relu"}, "name": "2_relu", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_3_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_3_conv_block", "inbound_nodes": [[["2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_3_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_3_batch_norm", "inbound_nodes": [[["residual_1_3_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_3_relu"}, "name": "residual_1_3_relu", "inbound_nodes": [[["residual_1_3_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_3_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_3_conv_block", "inbound_nodes": [[["residual_1_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_3_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_3_batch_norm", "inbound_nodes": [[["residual_2_3_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true}, "name": "add_3", "inbound_nodes": [[["2_relu", 0, 0, {}], ["residual_2_3_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "3_relu"}, "name": "3_relu", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_4_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_4_conv_block", "inbound_nodes": [[["3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_4_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_4_batch_norm", "inbound_nodes": [[["residual_1_4_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_4_relu"}, "name": "residual_1_4_relu", "inbound_nodes": [[["residual_1_4_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_4_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_4_conv_block", "inbound_nodes": [[["residual_1_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_4_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_4_batch_norm", "inbound_nodes": [[["residual_2_4_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true}, "name": "add_4", "inbound_nodes": [[["3_relu", 0, 0, {}], ["residual_2_4_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "4_relu"}, "name": "4_relu", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_5_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_5_conv_block", "inbound_nodes": [[["4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_5_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_5_batch_norm", "inbound_nodes": [[["residual_1_5_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_5_relu"}, "name": "residual_1_5_relu", "inbound_nodes": [[["residual_1_5_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_5_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_5_conv_block", "inbound_nodes": [[["residual_1_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_5_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_5_batch_norm", "inbound_nodes": [[["residual_2_5_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true}, "name": "add_5", "inbound_nodes": [[["4_relu", 0, 0, {}], ["residual_2_5_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "5_relu"}, "name": "5_relu", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_6_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_6_conv_block", "inbound_nodes": [[["5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_6_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_6_batch_norm", "inbound_nodes": [[["residual_1_6_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_6_relu"}, "name": "residual_1_6_relu", "inbound_nodes": [[["residual_1_6_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_6_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_6_conv_block", "inbound_nodes": [[["residual_1_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_6_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_6_batch_norm", "inbound_nodes": [[["residual_2_6_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true}, "name": "add_6", "inbound_nodes": [[["5_relu", 0, 0, {}], ["residual_2_6_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "6_relu"}, "name": "6_relu", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_7_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_7_conv_block", "inbound_nodes": [[["6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_7_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_7_batch_norm", "inbound_nodes": [[["residual_1_7_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_7_relu"}, "name": "residual_1_7_relu", "inbound_nodes": [[["residual_1_7_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_7_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_7_conv_block", "inbound_nodes": [[["residual_1_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_7_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_7_batch_norm", "inbound_nodes": [[["residual_2_7_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true}, "name": "add_7", "inbound_nodes": [[["6_relu", 0, 0, {}], ["residual_2_7_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "7_relu"}, "name": "7_relu", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_8_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_8_conv_block", "inbound_nodes": [[["7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_8_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_8_batch_norm", "inbound_nodes": [[["residual_1_8_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_8_relu"}, "name": "residual_1_8_relu", "inbound_nodes": [[["residual_1_8_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_8_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_8_conv_block", "inbound_nodes": [[["residual_1_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_8_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_8_batch_norm", "inbound_nodes": [[["residual_2_8_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true}, "name": "add_8", "inbound_nodes": [[["7_relu", 0, 0, {}], ["residual_2_8_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "8_relu"}, "name": "8_relu", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_9_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_9_conv_block", "inbound_nodes": [[["8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_9_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_9_batch_norm", "inbound_nodes": [[["residual_1_9_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_9_relu"}, "name": "residual_1_9_relu", "inbound_nodes": [[["residual_1_9_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_9_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_9_conv_block", "inbound_nodes": [[["residual_1_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_9_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_9_batch_norm", "inbound_nodes": [[["residual_2_9_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true}, "name": "add_9", "inbound_nodes": [[["8_relu", 0, 0, {}], ["residual_2_9_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "9_relu"}, "name": "9_relu", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_10_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_10_conv_block", "inbound_nodes": [[["9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_10_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_10_batch_norm", "inbound_nodes": [[["residual_1_10_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_10_relu"}, "name": "residual_1_10_relu", "inbound_nodes": [[["residual_1_10_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_10_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_10_conv_block", "inbound_nodes": [[["residual_1_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_10_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_10_batch_norm", "inbound_nodes": [[["residual_2_10_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_10", "trainable": true}, "name": "add_10", "inbound_nodes": [[["9_relu", 0, 0, {}], ["residual_2_10_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "10_relu"}, "name": "10_relu", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_11_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_11_conv_block", "inbound_nodes": [[["10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_11_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_11_batch_norm", "inbound_nodes": [[["residual_1_11_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_11_relu"}, "name": "residual_1_11_relu", "inbound_nodes": [[["residual_1_11_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_11_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_11_conv_block", "inbound_nodes": [[["residual_1_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_11_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_11_batch_norm", "inbound_nodes": [[["residual_2_11_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_11", "trainable": true}, "name": "add_11", "inbound_nodes": [[["10_relu", 0, 0, {}], ["residual_2_11_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "11_relu"}, "name": "11_relu", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_12_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_12_conv_block", "inbound_nodes": [[["11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_12_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_12_batch_norm", "inbound_nodes": [[["residual_1_12_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_12_relu"}, "name": "residual_1_12_relu", "inbound_nodes": [[["residual_1_12_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_12_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_12_conv_block", "inbound_nodes": [[["residual_1_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_12_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_12_batch_norm", "inbound_nodes": [[["residual_2_12_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_12", "trainable": true}, "name": "add_12", "inbound_nodes": [[["11_relu", 0, 0, {}], ["residual_2_12_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "12_relu"}, "name": "12_relu", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_13_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_13_conv_block", "inbound_nodes": [[["12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_13_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_13_batch_norm", "inbound_nodes": [[["residual_1_13_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_13_relu"}, "name": "residual_1_13_relu", "inbound_nodes": [[["residual_1_13_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_13_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_13_conv_block", "inbound_nodes": [[["residual_1_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_13_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_13_batch_norm", "inbound_nodes": [[["residual_2_13_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_13", "trainable": true}, "name": "add_13", "inbound_nodes": [[["12_relu", 0, 0, {}], ["residual_2_13_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "13_relu"}, "name": "13_relu", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_14_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_1_14_conv_block", "inbound_nodes": [[["13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_1_14_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_1_14_batch_norm", "inbound_nodes": [[["residual_1_14_conv_block", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "residual_1_14_relu"}, "name": "residual_1_14_relu", "inbound_nodes": [[["residual_1_14_batch_norm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_2_14_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "bias_constraint": null}, "name": "residual_2_14_conv_block", "inbound_nodes": [[["residual_1_14_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "axis": 1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "residual_2_14_batch_norm", "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "residual_2_14_batch_norm", "inbound_nodes": [[["residual_2_14_conv_block", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_14", "trainable": true}, "name": "add_14", "inbound_nodes": [[["13_relu", 0, 0, {}], ["residual_2_14_batch_norm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "14_relu"}, "name": "14_relu", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_first", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "activation": "linear", "name": "residual_1_15_conv_block", "filters": 256, "padding": "same", "bias_regularizer": null, 